//ЛЕГКИЕ ВОПРОСЫ

let easy = [

    {
        ask: "В чем разница между null и undefined?",
        answer: "",
    },

    {
        ask: "Для чего используется оператор \"&&\"?",
        answer: "",
    },

    {
        ask: "Для чего используется оператор \"||\"?",
        answer: "",
    },

    {
        ask: "Является ли использование унарного плюса (оператор \"+\") самым быстрым способом преобразования строки в число?",
        answer: "",
    },

    {
        ask: "Что такое DOM?",
        answer: "",
    },

    {
        ask: "Что такое распространение события (Event Propogation)?",
        answer: "",
    },

    {
        ask: "Что такое всплытие события (Event Bubbling)?",
        answer: "",
    },

    {
        ask: "Что такое погружение события (Event Capturing)?",
        answer: "",
    },

    {
        ask: "В чем разница между методами event.preventDefault() и event.stopPropagation()?",
        answer: "",
    },

    {
        ask: "Как узнать об использовании метода event.preventDefault()?",
        answer: "",
    },

    {
        ask: "Почему obj.someprop.x приводит к ошибке?",
        answer: "",
    },

    {
        ask: "Что такое цель события или целевой элемент (event.target)?",
        answer: "",
    },

    {
        ask: "Что такое текущая цель события (event.currentTarget)?",
        answer: "",
    },

    {
        ask: "В чем разница между операторами \"==\" и \"===\"?",
        answer: "",
    },

    {
        ask: "Почему результатом сравнения двух похожих объектов является false?",
        answer: "",
    },  

    {
        ask: "Для чего используется оператор \"!!\"?",
        answer: "",
    },

    {
        ask: "Как записать несколько выражений в одну строку?",
        answer: "",
    },

    {
        ask: "Что такое поднятие (Hoisting)?",
        answer: "",
    },

    {
        ask: "Что такое область видимости (Scope)?",
        answer: "",
    },

    {
        ask: "Что такое замыкание (Closures)?",
        answer: "",
    },

    {
        ask: "Какие значения в JS являются ложными?",
        answer: "",
    },

    {
        ask: "Как проверить, является ли значение ложным?",
        answer: "",
    },

    {
        ask: "Для чего используется директива «use strict»?",
        answer: "",
    },

    {
        ask: "Какое значение имеет this?",
        answer: "",
    },

    {
        ask: "Что такое прототип объекта?",
        answer: "",
    },

    {
        ask: "Что такое IIFE?",
        answer: "",
    },

    {
        ask: "Для чего используется метод Function.prototype.apply?",
        answer: "",
    },

    {
        ask: "Для чего используется метод Function.prototype.call?",
        answer: "",
    },

    {
        ask: "В чем разница между методами call и apply?",
        answer: "",
    },

    {
        ask: "Для чего используется метод Function.prototype.bind?",
        answer: "",
    },

    {
        ask: "Что такое функциональное программирование и какие особенности JS позволяют говорить о нем как о функциональном языке программирования?",
        answer: "",
    },

    {
        ask: "Что такое функции высшего порядка (Higher Order Functions)?",
        answer: "",
    },

    {
        ask: "Почему функции в JS называют объектами первого класса (First-class Objects)?",
        answer: "",
    },

    {
        ask: "Как бы Вы реализовали метод Array.prototype.map?",
        answer: "",
    },

    {
        ask: "Как бы Вы реализовали метод Array.prototype.filter?",
        answer: "",
    },

    {
        ask: "Как бы Вы реализовали метод Array.prototype.reduce?",
        answer: "",
    },

    {
        ask: "Что такое объект arguments?",
        answer: "",
    },

    {
        ask: "Как создать объект, не имеющий прототипа?",
        answer: "",
    },

    {
        ask: "Почему в представленном коде переменная b становится глобальной при вызове функции?",
        answer: "",
    },

    {
        ask: "Что такое ECMAScript?",
        answer: "",
    },

    {
        ask: "Что нового привнес в JS стандарт ES6 или ECMAScript2015?",
        answer: "",
    },

    {
        ask: "В чем разница между ключевыми словами «var», «let» и «const»?",
        answer: "",
    },

    {
        ask: "Что такое стрелочные функции (Arrow Functions)?",
        answer: "",
    },

    {
        ask: "Что такое классы (Classes)?",
        answer: "",
    },

    {
        ask: "Что такое шаблонные литералы (Template Literals)?",
        answer: "",
    },  

    {
        ask: "Что такое деструктуризация объекта (Object Destructuring)?",
        answer: "",
    },

    {
        ask: "Что такое модули (Modules)?",
        answer: "",
    },

    {
        ask: "Что такое объект Set?",
        answer: "",
    },

    {
        ask: "Что такое функция обратного вызова (Callback Function)?",
        answer: "",
    },

    {
        ask: "Что такое промисы (Promises)?",
        answer: "",
    },

    {
        ask: "Что такое async/await?",
        answer: "",
    },

    {
        ask: "В чем разница между spread-оператором и rest-оператором?",
        answer: "",
    },

    {
        ask: "Что такое параметры по умолчанию (Default Parameters)?",
        answer: "",
    },

    {
        ask: "Что такое объектная обертка (Wrapper Objects)?",
        answer: "",
    },

    {
        ask: "В чем разница между явным и неявным преобразованием или приведением к типу (Implicit and Explicit Coercion)?",
        answer: "",
    },

    {
        ask: "Что такое NaN? Как проверить, является ли значение NaN?",
        answer: "",
    },

    {
        ask: "Как проверить, является ли значение массивом?",
        answer: "",
    },

    {
        ask: "Как проверить, что число является четным, без использования деления по модулю или деления с остатком (оператора \"%\")?",
        answer: "",
    },

    {
        ask: "Как определить наличие свойства в объекте?",
        answer: "",
    },

    {
        ask: "Что такое AJAX?",
        answer: "",
    },


        /// Точка разрыва


    {
        ask: "Как в JS создать объект?",
        answer: "",
    },

    {
        ask: "В чем разница между методами Object.freeze и Object.seal?",
        answer: "",
    },

    {
        ask: "В чем разница между оператором «in» и методом hasOwnProperty?",
        answer: "",
    },

    {
        ask: "Какие приемы работы с асинхронным кодом в JS Вы знаете?",
        answer: "",
    },

    {
        ask: "В чем разница между обычной функцией и функциональным выражением?",
        answer: "",
    },

    {
        ask: "Как в JS вызвать функцию?",
        answer: "",
    },

    {
        ask: "Что такое запоминание или мемоизация (Memoization)?",
        answer: "",
    },

    {
        ask: "Как бы Вы реализовали вспомогательную функцию запоминания?",
        answer: "",
    },

    {
        ask: "Почему typeof null возвращает object? Как проверить, является ли значение null?",
        answer: "",
    },

    {
        ask: "Для чего используется ключевое слово «new»?",
        answer: "",
    },

    {
        ask: "Какие существуют типы данных в JS?",
        answer: "",
    },

    {
        ask: "Как проверить, является ли объект массивом?",
        answer: "",
    },

    {
        ask: "Как проверить, является ли число конечным?",
        answer: "",
    },

    {
        ask: "Как проверить, что переменная равна NaN?",
        answer: "",
    },

    {
        ask: "Чем отличается поведение isNaN() и Number.isNaN()?",
        answer: "",
    },

    {
        ask: "Сравните ключевые слова var, let, const.",
        answer: "",
    },

    {
        ask: "Что такое область видимости?",
        answer: "",
    },

    {
        ask: "Для чего предназначены методы setTimeout и setInterval?",
        answer: "",
    },

    {
        ask: "Сравните подходы работы с асинхронным кодом: сallbacks vs promises vs async / await.",
        answer: "",
    },

    {
        ask: "Можно ли записывать новые свойства / функции в прототипы стандартных классов (Array, Object и т. д.)? Почему нет? В каких случаях это делать можно? Как обезопасить себя, если нужно расширить прототип?",
        answer: "",
    },

    {
        ask: "Назовите методы массивов, какие помните, и скажите, для чего они нужны.",
        answer: "",
    },

    {
        ask: "Какие методы перебора массива знаете? В чем их отличие?",
        answer: "",
    },

    {
        ask: "Как работают операторы присваивания / сравнения / строчные / арифметические / битовые и т. д.?",
        answer: "",
    },

    {
        ask: "Опишите назначение и принципы работы с коллекциями Map и Set.",
        answer: "",
    },

    {
        ask: "Что означает глубокая (deep) и поверхностная (shallow) копия объекта? Как сделать каждую из них?",
        answer: "",
    },

    {
        ask: "Какая разница между декларацией функции (function declaration) и функциональным выражением (function expression)?",
        answer: "",
    },

    {
        ask: "Что такое анонимная функция?",
        answer: "",
    },

    {
        ask: "Расскажите о стрелочных функциях (arrow function). В чем заключаются отличия стрелочных функций от обычных?",
        answer: "",
    },

    {
        ask: "Как вы понимаете замыкания? ",
        answer: "",
    },

    {
        ask: "Что такое рекурсия?",
        answer: "",
    },

    {
        ask: "Что такое потеря контекста, когда происходит и как ее предотвратить?",
        answer: "",
    },

    {
        ask: "Методы функций bind / call / apply - зачем и в чем разница?",
        answer: "",
    },

    {
        ask: "Сравните атрибуты подключения скрипта async и defer в HTML-документе.",
        answer: "",
    },

    {
        ask: "Какая разница между свойствами HTML-элементов innerHTML и innerText?",
        answer: "",
    },

    {
        ask: "Опишите процесс всплытия (bubbling) событий в DOM.",
        answer: "",
    },

    {
        ask: "Как остановить всплытие (bubbling) события?",
        answer: "",
    },

    {
        ask: "Как остановить дефолтную обработку события?",
        answer: "",
    },

    {
        ask: "Чему равен this в обработчике событий (event handler)?",
        answer: "",
    },

    {
        ask: "Что такое LocalStorage и SessionStorage? Какой максимальный размер LocalStorage?",
        answer: "",
    },

    {
        ask: "Как получить высоту блока? Его положение относительно границ документа?",
        answer: "",
    },

    {
        ask: "Что такое webpack?",
        answer: "",
    },

    {
        ask: "Чем отличается dev-сборник от prod?",
        answer: "",
    },

    {
        ask: "Что такое блочная модель CSS?",
        answer: "",
    },

    {
        ask: "Какие способы центрирования блочного контента по горизонтали и вертикали знаете?",
        answer: "",
    },

    {
        ask: "Какие подходы в верстке вам известны (float, flex, grid, etc.)?",
        answer: "",
    },

    {
        ask: "Как сделать приложение responsive?",
        answer: "",
    },

    {
        ask: "Какие есть принципы семантической верстки?",
        answer: "",
    },

    {
        ask: "Зачем нужны префиксы для некоторых CSS-свойств (-webkit-, -moz- и т. д.)?",
        answer: "",
    },

    {
        ask: "Как упростить написание кросс-браузерных стилей?",
        answer: "",
    },

    {
        ask: "Что такое CSS-препроцессоры? С какими работали? Что нового они приносят в стандартный CSS?",
        answer: "",
    },

    {
        ask: "Объясните разницу между единицами измерения px, em, rem.",
        answer: "",
    },

    {
        ask: "Для чего нужны CSS-переменные? Приведите несколько примеров использования.",
        answer: "",
    },

    {
        ask: "Что произойдет при добавлении селектора (* {Box-sizing: border-box; })?",
        answer: "",
    },

    {
        ask: "Как адаптировать страницу для печати?",
        answer: "",
    },

    {
        ask: "Опишите особенности кастомизации стилей стандартных элементов форм.",
        answer: "",
    },

    {
        ask: "Что такое progressive рендеринг? Какие подходы используются?",
        answer: "",
    },

    {
        ask: "Назовите несколько способов реализации lazy-loading медиаресурсов на странице.",
        answer: "",
    },

    {
        ask: "Назовите популярные шаблонизаторы для фронтенд-разработки. Опишите особенности их использования.",
        answer: "",
    },

    {
        ask: "Назовите популярные CSS-методологии и их различия.",
        answer: "",
    },

    {
        ask: "Как работает CSS Grid?",
        answer: "",
    },

    {
        ask: "Какие форматы изображений поддерживают анимацию?",
        answer: "",
    },

    {
        ask: "Как отследить прогресс / окончание CSS @keyframes анимаций или плавных переходов, реализованных с помощью transition, в JS?",
        answer: "",
    },

    {
        ask: "Какие CSS-свойства могут быть обработаны непосредственно через GPU? Что такое композитные слои и почему большое их количество может привести к аварийному завершению работы браузера на мобильных устройствах?",
        answer: "",
    },

    {
        ask: "Как переиспользовать Инлайн SVG-элементы на странице?",
        answer: "",
    },

    {
        ask: "Опишите способы оптимизации SVG-файлов.",
        answer: "",
    },

    {
        ask: "Как реализовать иконочный шрифт из определенного набора SVG-файлов?",
        answer: "",
    },

    {
        ask: "Что такое ложное жирное или ложное курсивное (Faux) начертание шрифтов?",
        answer: "",
    },

    {
        ask: "Что такое #shadow-root в инспекторе HTML-страницы?",
        answer: "",
    },

    {
        ask: "Зачем нужны Custom Elements?",
        answer: "",
    },

    {
        ask: "Почему удаление лишних символов пробелов / символов переноса в HTML не отражается на конечной производительности загрузки страницы?",
        answer: "",
    },

    {
        ask: "Что такое контекст отображения canvas? Какие существуют типы контекста для рендеринга двумерной и трехмерной графики?",
        answer: "",
    },
];



