//СЛОЖНЫЕ ВОПРОСЫ

let hard = [

    {
        ask: "Работали ли вы с классовыми компонентами? В чем их особенность? (React)",
        answer: "",
    },

    {
        ask: "Какие данные лучше хранить в состоянии компонента, а какие передавать через пропсы? Приведите пример. (React)",
        answer: "",
    },

    {
        ask: "Ознакомлены ли вы с хуками? В чем их преимущества? Приходилось ли делать свои и с какой целью? (React)",
        answer: "",
    },

    {
        ask: "Знакомы ли вы с фрагментами и порталами? Зачем они нужны? (React)",
        answer: "",
    },

    {
        ask: "Когда и для чего используют рефы? (React)",
        answer: "",
    },

    {
        ask: "Какие вы знаете методы жизненного цикла компонента? (React)",
        answer: "",
    },

    {
        ask: "В каком методе жизненного цикла компонента лучше делать запросы на сервер? Почему? (React)",
        answer: "",
    },

    {
        ask: "В каком методе жизненного цикла компонента лучше делать подписку и отписку от листенера? Почему? Зачем отписываться? (React)",
        answer: "",
    },

    {
        ask: "Был ли опыт работы с контекстом? Когда его стоит использовать? (React)",
        answer: "",
    },

    {
        ask: "В чем особенность PureComponent? (React)",
        answer: "",
    },

    {
        ask: "Работали ли вы с мемоизоваными селекторами (memoized selectors)? Для чего их используют и какой принцип работы? (React)",
        answer: "",
    },

    {
        ask: "В чем видите преимущества библиотеки React? (React)",
        answer: "",
    },

    {
        ask: "Почему библиотека React быстрая? Что такое Virtual DOM и Shadow DOM? (React)",
        answer: "",
    },

    {
        ask: "Зачем в списках ключи? Можно ли делать ключами индексы элементов массива? Когда это оправдано? (React)",
        answer: "",
    },

    {
        ask: "В чем основная идея Redux? (React)",
        answer: "",
    },

    {
        ask: "Работа со стилями в React. (React)",
        answer: "",
    },

    {
        ask: "React - это библиотека или фреймворк? Какая разница между этими двумя понятиями. (React)",
        answer: "",
    },

    {
        ask: "Можно ли использовать jQuery вместе с React? Почему да / нет? (React)",
        answer: "",
    },

    {
        ask: "Что такое codemod? (React)",
        answer: "",
    },

    {
        ask: "Приходилось ли вам настраивать проект React с нуля? С помощью каких инструментов вы это делали? (React)",
        answer: "",
    },

    {
        ask: "Перечислите все библиотеки, которые использовали в связке с React. (React)",
        answer: "",
    },

    {
        ask: "Что самое сложное вам приходилось реализовывать с помощью React? (React)",
        answer: "",
    },

    {
        ask: "Что такое REPL? (Back-end)",
        answer: "",
    },

    {
        ask: "Что такое streams в Node.js? (Back-end)",
        answer: "",
    },

    {
        ask: "Что такое middleware? (Back-end)",
        answer: "",
    },

    {
        ask: "Для чего используют функцию setImmediate? (Back-end)",
        answer: "",
    },

    {
        ask: "Зачем нужен app.param() в express? (Back-end)",
        answer: "",
    },

    {
        ask: "Что такое token based authentication? (Back-end)",
        answer: "",
    },

    {
        ask: "Напишите простой запрос для вычисления трех авторов, у которых больше всего книг. (Базы данных)",
        answer: "",
    },

    {
        ask: "Напишите запрос, который выбирает последние три комментарии для конкретного пользователя для двух таблиц: комментарии и пользователи. (Базы данных)",
        answer: "",
    },

    {
        ask: "Спроектируйте простую схему базы данных для библиотеки. (Базы данных)",
        answer: "",
    },

    {
        ask: "Для чего используют SQL-оператор HAVING? (Базы данных)",
        answer: "",
    },

    {
        ask: "Зачем используют SQL-оператор LEFT JOIN? (Базы данных)",
        answer: "",
    },

    {
        ask: "Чем отличается embed- от reference-связи в MongoDB? (Базы данных)",
        answer: "",
    },

    {
        ask: "В одном проекте программисты сохраняют данные в MongoDB-коллекции комментариев, используя такие типы данных (d: ObjectID / text: string / author_id: string / created_at: Date) Что плохого в этом решении? (Базы данных)",
        answer: "",
    },

    {
        ask: "В проекте понадобилось внести изменения в структуру таблиц, добавить несколько полей и индексы. Как программисты будут делать это на продакшене? (Базы данных)",
        answer: "",
    },

    {
        ask: "Каждый раз, когда вы делаете pull, почему-то случается конфликт в последней строке во всех файлах, которые вы редактировали. Что происходит? (Инструменты)",
        answer: "",
    },

    {
        ask: "Что делает команда git fetch? (Инструменты)",
        answer: "",
    },

    {
        ask: "Какой git hygiene подходы вы знаете? (Инструменты)",
        answer: "",
    },

    {
        ask: "Что такое CI / CD? Для чего это нужно? (Инструменты)",
        answer: "",
    },

    {
        ask: "Что такое NPM? (Инструменты)",
        answer: "",
    },

    {
        ask: "Что такое JSX? Что лежит в его основе? (React)",
        answer: "",
    },

    {
        ask: "Как работает алгоритм Virtual DOM? (React)",
        answer: "",
    },

    {
        ask: "Для чего нужно свойство key во время рендеринга списков? (React)",
        answer: "",
    },

    {
        ask: "В чем разница между функциональными и классовыми компонентами? (React)",
        answer: "",
    },

    {
        ask: "Зачем и когда нужно передавать props в super() при использовании классовых компонентов? (React)",
        answer: "",
    },

    {
        ask: "Почему нужно использовать setState() для обновления внутреннего состояния компонента? (React)",
        answer: "",
    },

    {
        ask: "В чем заключается принцип «подъема состояния»? (React)",
        answer: "",
    },

    {
        ask: "Какие библиотеки менеджмента состояния React-приложения вы знаете? Зачем они нужны? (React)",
        answer: "",
    },

    {
        ask: "Когда следует использовать Redux? Какие есть альтернативы? (React)",
        answer: "",
    },

    {
        ask: "Redux vs Mobx? (React)",
        answer: "",
    },

    {
        ask: "Расскажите о базовом принципе работы React Hooks. (React)",
        answer: "",
    },

    {
        ask: "В чем разница между createRef и useRef? (React)",
        answer: "",
    },

    {
        ask: "Когда следует использовать React refs? Когда не стоит? (React)",
        answer: "",
    },

    {
        ask: "Какие недостатки библиотеки React видите? (React)",
        answer: "",
    },

    {
        ask: "Какие паттерны используете вместе с React? (React)",
        answer: "",
    },

    {
        ask: "Как относитесь к типизации вместе с React? (React)",
        answer: "",
    },

    {
        ask: "Как построить хорошую архитектуру React-проекта? (React)",
        answer: "",
    },

    {
        ask: "Оптимизация React-приложений? Как измерить производительность программы? (React)",
        answer: "",
    },

    {
        ask: "Можно ли приложение на React встроить в другое приложение на React? (React)",
        answer: "",
    },
];