//ВОПРОСЫ СРЕДНЕЙ СЛОЖНОСТИ

let normal = [
    {
        ask: "Какие методы HTTP-запросов вы знаете?",
        answer: "",
    },

    {
        ask: "Какие версии HTTP-протокола вам известны?",
        answer: "",
    },

    {
        ask: "Какие знаете коды ответа (состояния) HTTP?",
        answer: "",
    },

    {
        ask: "Что такое Cross-Origin Resource Sharing? Как устранить проблемы с CORS?",
        answer: "",
    },

    {
        ask: " Что такое cookie?",
        answer: "",
    },

    {
        ask: "Какой максимальный размер cookie?",
        answer: "",
    },

    {
        ask: "Что означает директива use strict?",
        answer: "",
    },

    {
        ask: "Чем JS отличается при работе на front-end и back-end?",
        answer: "",
    },

    {
        ask: "Что такое статическая и динамическая типизации?",
        answer: "",
    },

    {
        ask: "Как клиент взаимодействует с сервером?",
        answer: "",
    },

    {
        ask: "Что такое REST?",
        answer: "",
    },

    {
        ask: "Объяснить понятие мутабельность/иммутабельность? Какие типы являются мутабельными и наоборот?",
        answer: "",
    },

    {
        ask: "Как искать ошибки в коде? Используете ли вы дебаггер?",
        answer: "",
    },

    {
        ask: "Каких известных людей из мира JS знаете?",
        answer: "",
    },

    {
        ask: "Расскажите, какие есть способы копирования простого объекта типа obj = {a 1, b 2, c 3}",
        answer: "",
    },

    {
        ask: "Напишите deep clone для объекта.",
        answer: "",
    },

    {
        ask: "Назовите различные способы, как поменять местами значения двух переменных.",
        answer: "",
    },

    {
        ask: "Менеджер попросил в задаче поменять статусы из «active, inactive» на «active, removed», но в коде фигурируют только цифры и непонятно, какой статус соответствует какой цифре. Как помочь будущим программистам не лезть в документацию по коду?",
        answer: "",
    },

    {
        ask: "Необходимо сделать мини проект - список пользователей с формой создания / редактирования пользователя",
        answer: "",
    },

    {
        ask: "В чем принципиальная разница между событиями mouseleave и mouseout?",
        answer: "",
    },

    {
        ask: "В каком порядке обрабатываются пользовательские события в DOM (click, mouseover и т .д.)? FIFO или LIFO?",
        answer: "",
    },

    {
        ask: "Что такое Event bubbling и Event capturing?",
        answer: "",
    },

    {
        ask: "Какие есть подходы оптимизации производительности веб-страницы?",
        answer: "",
    },

    {
        ask: "Как реализован механизм same-origin policy в браузере? На какие браузерные API он распространяется?",
        answer: "",
    },

    {
        ask: "Назовите способы хранения данных в браузере. Сравните их.",
        answer: "",
    },

    {
        ask: "Web worker`ы. Опишите особенности передачи данных между worker`амы и основным потоком, между разделенными worker`амы.",
        answer: "",
    },

    {
        ask: "Что такое Transferable-объекты?",
        answer: "",
    },

    {
        ask: "Расскажите о способах оптимизации выполнения ресурсоемких операций JS для улучшения производительности рендеринга контента на странице.",
        answer: "",
    },

    {
        ask: "Почему ResizeObserver вызывает события изменения размера до воспроизведения элемента, а не после?",
        answer: "",
    },

    {
        ask: "Расскажите, как вы понимаете Web Accessibility?",
        answer: "",
    },

    {
        ask: "Опишите алгоритм создания функционала, который обеспечивает чтение содержимого .txt файла при перетаскивании его из файловой системы в окно браузера.",
        answer: "",
    },

    {
        ask: "Что такое Virtual DOM?",
        answer: "",
    },

    {
        ask: "Расскажите о функциональном программировании.",
        answer: "",
    },

    {
        ask: "Что такое TDD (Test Driven Development) / BDD (Behaver Driven Development)?",
        answer: "",
    },

    {
        ask: "Расскажите подробно о работе HTTPS.",
        answer: "",
    },

    {
        ask: "Какой стек технологий можно выбрать для реализации клона какого-нибудь известного проекту и почему?",
        answer: "",
    },

    {
        ask: "Имеется проект на старых технологиях, необходимо в него вносить изменения. Как это сделать лучше всего?",
        answer: "",
    },

    {
        ask: "Если у кандидата есть опыт работы с несколькими фреймворками: какой будете использовать для следующего проекта? Какие факторы будут влиять на выбор?",
        answer: "",
    },

    {
        ask: "Что такое V8 Engine?",
        answer: "",
    },

    {
        ask: "Использование регулярных выражений. Когда приемлемо / неприемлемо? Как они работают? Как можно сделать читабельный код?",
        answer: "",
    },

    {
        ask: "Как браузер определяет, можем ли мы общаться между вкладками?",
        answer: "",
    },

    {
        ask: "Что такое Content Security Policy?",
        answer: "",
    },

    {
        ask: "Как избежать загрузки кэшированных файлов скриптов и стилей?",
        answer: "",
    },

    {
        ask: "Какие знаете метрики веб-сайта?",
        answer: "",
    },
];